package com.mozss.basic.algorithms.leetcode.dynamicplanning;

/**
 * @author mozss
 * @create 2019-09-04 16:06
 */
public class No198 {
	/*
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 题目名称:   198.打家劫舍
	 * 知识考察:
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 题目描述:   你是一个专业的小偷,计划偷盗沿街的房屋.每间房间中到藏有一定的现金.
	 *             影响你偷窃的唯一的制约因素就是相邻的房屋装有相互连通的防盗系统.
	 *             如果两间相邻的房屋在同一晚上被偷,系统会自动报警.
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * eg 1>:
	 * 输入Input:    [1,2,3,1]
	 * 输出Output:   4
	 * 说明:     偷盗1号房屋(金额=1),然后偷3号房屋(金额=3)
	 *            偷盗的最大的金额 = 1 + 3 = 4
	 *
	 * eg 2>:
	 * 输入Input:    [2,7,9,3,1]
	 * 输出Output: 12
	 * 说明:     偷盗1号屋->偷盗3号屋->偷盗5号屋
	 *            2+9+1=12
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 解题思路:
	 * 题目总结:
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 */
}
