package com.mozss.basic.algorithms.leetcode.binary;

/**
 * @author mozss
 * @create 2019-09-06 8:45
 */
public class No704 {
	/**
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 题目名称:   704.二分查找
	 * 知识考察:
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 题目描述:   给定一个n个元素有序的(升序)整数数组nums和一个目标值target,写一个函数搜索nums中
	 *             的target,如果目标值存在返回下标,否则放回-1
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * eg 1>:
	 * 输入Input:
	 * 输出Output:
	 * 说明:
	 *
	 * eg 2>:
	 * 输入Input:
	 * 输出Output:
	 * 说明:
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 * 解题思路:
	 * 题目总结:
	 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
	 **/
}
