package com.mozss.basic.algorithms.leetcode.array;

/**
 * @author mozss
 * @create 2019-09-06 16:24
 */
public class No15 {
    /*
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     * 题目编号: 15
     * 题目名称: 三数之和
     * 知识考察:
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     * 题目描述: 给定一个包含n个整数的数组nums，判断nums中是否存在三个元素：a，b，c
     *             使得a + b + c = 0 ？
     *             注意： 答案中不可以包含重复的三元组
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     * 输入Input: nums = [-1,0,1,2,-1,-4]
     * 输出Output: [
     *                  [-1,0,1]
     *                  [-1,-1,2]
     *              ]
     *
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     * 解题思路:
     * 题目总结:
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     */
   
}

